Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is '^]'.

PC2A> ip 192.168.2.2
Checking for duplicate address...
PC1 : 192.168.2.2 255.255.255.0

PC2A> ip 192.168.2.2 255.255.255.0 192.168.2.1
Checking for duplicate address...
PC1 : 192.168.2.2 255.255.255.0 gateway 192.168.2.1

PC2A> save
Saving startup configuration to startup.vpc
.  done

PC2A> ip 2191:B:B:2::2/64 2191:B:B:2::1
PC1 : 2191:b:b:2::2/64 

PC2A> save
Saving startup configuration to startup.vpc
.  done

PC2A>   