Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is '^]'.

PC2B> ip 192.168.2.3 255.255.255.0 192.168.2.1
Checking for duplicate address...
PC1 : 192.168.2.3 255.255.255.0 gateway 192.168.2.1

PC2B> save
Saving startup configuration to startup.vpc
.  done

PC2B> ip 2191:B:B:2::3/64 2191:B:B:2::1 
PC1 : 2191:b:b:2::3/64 

PC2B> save
Saving startup configuration to startup.vpc
.  done

PC2B>
