Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is '^]'.

PC3A> ip 192.168.3.3 255.255.255.0 192.168.3.2
Checking for duplicate address...
PC1 : 192.168.3.3 255.255.255.0 gateway 192.168.3.2

PC3A> save
Saving startup configuration to startup.vpc
.  done

PC3A> ip 2191:B:B:3::3/64 2191:B:B:3::2
PC1 : 2191:b:b:3::3/64 

PC3A> save
Saving startup configuration to startup.vpc
.  done

PC3A>
